/*----------------- platform.h
*
* Copyright (C): 2011  Mokylin·Mokyqi
* Author       : 赵文源
* Version      : V1.0
* Date         : 2012/3/10 12:52:27
*--------------------------------------------------------------
*
*------------------------------------------------------------*/
#pragma once
#include "basic/basicTypes.h"
/*************************************************************/
//#############################################################
//############################## error
//#############################################################
//--- 获得错误码
extern long			get_error		();
//--- 获得错误字符串
void	get_error_str	(long _error, std::string &err);
//--- 获得错误字符串
/* linux下调用时无错误会多余打印输出 */
void	get_herror_str	(std::string &err);
//--- 获得错误字符串
void	get_herror_str	(long _error, std::string &err);

//#############################################################
//############################## 文件目录相关
//#############################################################
//--- 查询目录是否存在
extern bool	findDirectory	(pc_str _dir);
//--- 创建目录
extern bool	createDirectory	(pc_str _dir,char _break = '/');
